app/views/blogs/daily_rank.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."blog_id" = ? AND "favorites"."created_at" BETWEEN ? AND ?  [["blog_id", 7], ["created_at", "2021-05-22 00:00:00"], ["created_at", "2021-05-22 23:59:59.999999"]]
---
        <li class="fas fa-crown non-margin">ランク：<b><%= i+1 %>位</b></li>
        <li>今日いいね：<b><%= blog.favorites.where(created_at: Time.zone.now.all_day).count %></b></li>