app/views/blogs/monthly_rank.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."blog_id" = ? AND "favorites"."created_at" BETWEEN ? AND ?  [["blog_id", 4], ["created_at", "2021-05-01 00:00:00"], ["created_at", "2021-05-31 23:59:59.999999"]]
---
        <li class="fas fa-crown non-margin">ランク：<b><%= i+1 %>位</b></li>
        <li>月間いいね：<b><%= blog.favorites.where(created_at: Time.now.all_month).count %></b></li>