app/views/blogs/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <div class="col-sm-3 mt-1">
          <h4>follow<%= @blog.user.followings.count %></h4>
          <h4>follower<%= @blog.user.followers.count %></h4>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."blog_id" = ?  [["blog_id", 1]]
---
          <%= link_to blog_favorites_path(@blog), method: :delete do %>
            <i class="fas fa-heart text-danger"></i><%= @blog.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."blog_id" = ?  [["blog_id", 1]]
---
          <%= link_to blog_favorites_path(@blog), method: :post do %>
            <i class="far fa-heart text-dark"></i><%= @blog.favorites.count %>

SELECT COUNT(*) FROM "blog_comments" WHERE "blog_comments"."blog_id" = ?  [["blog_id", 1]]
SELECT "blog_comments".* FROM "blog_comments" WHERE "blog_comments"."blog_id" = ?  [["blog_id", 1]]
---
    <div class="col offset-1 d-flex align-items-start flex-column">
      <p>コメント件数：<%= @blog.blog_comments.count %></p>