app/views/blogs/weekly_rank.html.erb

        <li class="fas fa-crown non-margin">ランク：<b><%= i+1 %>位</b></li>
        <li>週間いいね：<b><%= blog.favorites.where(created_at: 1.week.ago.beginning_of_day..Time.zone.now.end_of_day).count %></b></li>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."blog_id" = ? AND "favorites"."created_at" BETWEEN ? AND ?  [["blog_id", 1], ["created_at", "2021-05-11 00:00:00"], ["created_at", "2021-05-18 23:59:59.999999"]]