app/views/favorites/_favorite.html.erb

    <%= link_to blog_favorites_path(blog.id), method: :delete, remote: true do %>
      <i class="fas fa-heart text-danger"></i><%= blog.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."blog_id" = ?  [["blog_id", 7]]

    <%= link_to blog_favorites_path(blog.id), method: :post, remote: true do %>
      <i class="far fa-heart text-dark"></i><%= blog.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."blog_id" = ?  [["blog_id", 8]]