app/views/users/show.html.erb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = ?  [["user_id", 1]]
---
    <div class="col offset-1">
      <% @user.blogs.each do |blog| %>