app/controllers/blog_comments_controller.rb

  def create
    @blog = Blog.find(params[:blog_id])
    @blog_comment = current_user.blog_comments.new(blog_comment_params)
    @blog_comment.blog_id = @blog.id
    @blog_comment.save
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "blog_comments" ("comment", "user_id", "blog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "nice!"], ["user_id", 1], ["blog_id", 1], ["created_at", "2021-05-11 15:43:35.450980"], ["updated_at", "2021-05-11 15:43:35.450980"]]

  def destroy
    @blog = Blog.find(params[:blog_id])
    BlogComment.find_by(id: params[:id], blog_id: params[:blog_id]).destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "blog_comments" WHERE "blog_comments"."id" = ?  [["id", 2]]
SELECT  "blog_comments".* FROM "blog_comments" WHERE "blog_comments"."id" = ? AND "blog_comments"."blog_id" = ? LIMIT ?  [["id", 2], ["blog_id", 1], ["LIMIT", 1]]