app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "description", "image_id", "user_id", "created_at", "updated_at", "country_name", "address", "latitude", "longitude") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @blog = Blog.new(blog_params)
    @blog.user_id = current_user.id
    @blog.save

SELECT "blogs".* FROM "blogs" ORDER BY "blogs"."created_at" DESC
---
  def index
    @blogs = Blog.all

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "image_id" = ?, "country_name" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["image_id", "12b5fa011d6d99feefb16b56755a4a64e76a6c7903309bce44bddf3fec99"], ["country_name", "JP"], ["updated_at", "2021-05-20 10:53:16.425967"], ["id", 1]]
---
  def update
    @blog = Blog.find(params[:id])
    @blog.update(blog_params)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def destroy
    @blog = Blog.find(params[:id])

SELECT  "blogs".* FROM "blogs" INNER JOIN "favorites" ON "favorites"."blog_id" = "blogs"."id" WHERE "favorites"."created_at" BETWEEN ? AND ? GROUP BY "blogs"."id" ORDER BY count(favorites.blog_id) DESC LIMIT ?  [["created_at", "2021-05-18 00:00:00"], ["created_at", "2021-05-18 23:59:59.999999"], ["LIMIT", 5]]
---
    def daily_rank
      # @days = Blog.this_day
      @days = Blog.joins(:favorites).where(favorites: { created_at: Time.zone.now.all_day})
      .group(:id).order("count(favorites.blog_id) DESC").limit(5)

SELECT  "blogs".* FROM "blogs" INNER JOIN "favorites" ON "favorites"."blog_id" = "blogs"."id" WHERE "favorites"."created_at" BETWEEN ? AND ? GROUP BY "blogs"."id" ORDER BY count(favorites.blog_id) DESC LIMIT ?  [["created_at", "2021-05-11 00:00:00"], ["created_at", "2021-05-18 23:59:59.999999"], ["LIMIT", 5]]
---
    def weekly_rank
      # @weeks = Blog.this_week
      @weeks = Blog.joins(:favorites).where(favorites: {created_at: 1.week.ago.beginning_of_day..Time.zone.now.end_of_day})
      .group(:id).order("count(favorites.blog_id) DESC").limit(5)

SELECT  "blogs".* FROM "blogs" INNER JOIN "favorites" ON "favorites"."blog_id" = "blogs"."id" WHERE "favorites"."created_at" BETWEEN ? AND ? GROUP BY "blogs"."id" ORDER BY count(favorites.blog_id) DESC LIMIT ?  [["created_at", "2021-05-01 00:00:00"], ["created_at", "2021-05-31 23:59:59.999999"], ["LIMIT", 5]]
---
    def monthly_rank
      # @months = Blog.this_month
      @months = Blog.joins(:favorites).where(favorites: {created_at: Time.now.all_month})
      .group(:id).order("count(favorites.blog_id) DESC").limit(5)