app/controllers/blogs_controller.rb

  def show
    @blog = Blog.find(params[:id])
    gon.blog = @blog
    @blog_comment = BlogComment.new
    @blog_comments = BlogComment.all
---
SELECT "blog_comments".* FROM "blog_comments" WHERE "blog_comments"."blog_id" = ?  [["blog_id", 1]]