app/controllers/searches_controller.rb

SELECT "blogs".* FROM "blogs" WHERE (country_name = 'JP')
SELECT COUNT(*) FROM "blogs" WHERE (country_name = 'JP')
SELECT  "blogs".* FROM "blogs" WHERE (country_name = 'JP') LIMIT ? OFFSET ?  [["LIMIT", 16], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs"
---
  def search_country
    country_code = params[:country_name]
    @country = Blog.where("country_name = ?", country_code)
    @country = Blog.page(params[:page]).per(16)