app/controllers/users_controller.rb

  def index
    @users = User.page(params[:page]).per(10)
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def show
    @user = User.find(params[:id])
    @userblogs = Blog.page(params[:page]).per(8)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "blogs"
SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = ?  [["user_id", 1]]

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "3c772750aaa7f81a8115769f870aea1573a0d00930d94f20acefb663f959"], ["introduction", "test"], ["updated_at", "2021-05-12 08:44:53.780934"], ["id", 2]]

  def destroy
    user = current_user
    user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]