app/views/blog_comments/_index.html.erb

SELECT "blog_comments".* FROM "blog_comments" WHERE "blog_comments"."blog_id" = ?  [["blog_id", 8]]
SELECT COUNT(*) FROM "blog_comments" WHERE "blog_comments"."blog_id" = ?  [["blog_id", 8]]
---
<div class="col mt-1 offset-2 d-flex align-items-start flex-column">
  <p>コメント件数：<%= blog.blog_comments.count %></p>
  <% blog.blog_comments.each do |blog_comment| %>

INSERT INTO "blog_comments" ("comment", "user_id", "blog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "nice"], ["user_id", 1], ["blog_id", 1], ["created_at", "2021-05-22 01:26:06.883404"], ["updated_at", "2021-05-22 01:26:06.883404"]]
---
    <%= blog_comment.user.name %>
    [<%= blog_comment.created_at.strftime('%Y/%m/%d') %>]